Revit 2027 API
BuiltInFailures.StairRampFailures.StairsTopEndExceedsOrNotReachWarning Property
 Stair top end exceeds or cannot reach the top elevation of the stair. Add/remove risers at the top end or change top elevation settings in Stair Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsTopEndExceedsOrNotReachWarning { get; }
Public Shared ReadOnly Property StairsTopEndExceedsOrNotReachWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsTopEndExceedsOrNotReachWarning {
	FailureDefinitionId^ get ();
}
static member StairsTopEndExceedsOrNotReachWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace